{
    "100734": {
        "subject": "ACCT",
        "code": "210",
        "year": "2021-2022",
        "title": "Financial Accounting",
        "description": "Financial accounting is the measurement of economic activity for decision-making. Financial statements are a key product of this measurement process and an important component of firms' financial reporting activities. The objective of this course is not to train you to become an accountant but rather to help you develop into an informed user of financial statement information. While financial statement users face a wide variety of decisions, they are often interested in understanding the implications of financial statement information for the future cash flows and earnings potential of a firm. We will focus on understanding the mapping between underlying economic events and financial statements, and on understanding how this mapping affects inferences about future profitability and liquidity. The following learning objectives will be emphasized: (1) familiarity with the transactions businesses engage in, (2) fluency in accounting terminology, (3) understanding the structure that maps transactions into accounting numbers, (4) understanding the rationale for various accounting methods, and (5) awareness of the judgment involved and the discretion allowed in choosing accounting methods, making estimates, and disclosing information in financial statements.",
        "gers": "('',)",
        "repeatable": "False",
        "grading_basis": "GSB Letter Graded",
        "units_min": "3",
        "units_max": "3",
        "final_exam": "False",
        "course_id": "100734",
        "active": "True",
        "offer_num": "1",
        "academic_group": "GSB",
        "academic_org": "GSB",
        "academic_career": "GSB",
        "max_units_repeat": "3",
        "max_times_repeat": "1",
        "prerequisites": "",
        "corequisites": ""
    },
    "105821": {
        "subject": "CS",
        "code": "319",
        "year": "2021-2022",
        "title": "Topics in Digital Systems",
        "description": "Advanced material is often taught for the first time as a topics course, perhaps by a faculty member visiting from another institution. May be repeated for credit.",
        "gers": "('',)",
        "repeatable": "True",
        "grading_basis": "Letter or Credit/No Credit",
        "units_min": "3",
        "units_max": "3",
        "final_exam": "False",
        "course_id": "105821",
        "active": "True",
        "offer_num": "1",
        "academic_group": "ENGR",
        "academic_org": "COMPUTSCI",
        "academic_career": "GR",
        "max_units_repeat": "999",
        "max_times_repeat": "99",
        "prerequisites": "",
        "corequisites": ""
    },
    "206116": {
        "subject": "EE",
        "code": "124",
        "year": "2021-2022",
        "title": "Introduction to Neuroelectrical Engineering",
        "description": "Fundamental properties of electrical activity in neurons, technology for measuring and altering neural activity, and operating principles of modern neurological and neural prosthetic medical systems. Topics: action potential generation and propagation, neuro-MEMS and measurement systems, experimental design and statistical data analysis, information encoding and decoding, clinical diagnostic systems, and fully-implantable neural prosthetic systems design. Prerequisite: EE 101A and EE 102A.",
        "gers": "('WAY-SMA',)",
        "repeatable": "False",
        "grading_basis": "Letter or Credit/No Credit",
        "units_min": "3",
        "units_max": "3",
        "final_exam": "True",
        "course_id": "206116",
        "active": "True",
        "offer_num": "1",
        "academic_group": "ENGR",
        "academic_org": "ELECTENGR",
        "academic_career": "UG",
        "max_units_repeat": "3",
        "max_times_repeat": "1",
        "prerequisites": " EE 101A and EE 102A",
        "corequisites": ""
    },
    "216317": {
        "subject": "COMM",
        "code": "173E",
        "year": "2021-2022",
        "title": "Data Challenge Lab (ENGR 150)",
        "description": "In this lab, students develop the practical skills of data science by solving a series of increasingly difficult, real problems. Skills developed include: data manipulation, data visualization, exploratory data analysis, and basic modeling. The data challenges each student undertakes are based upon their current skills. Students receive one-on-one coaching and see how expert practitioners solve the same challenges. Limited enrollment; application required. See http://datalab.stanford.edu for more information.",
        "gers": "('WAY-AQR', 'WAY-CE')",
        "repeatable": "False",
        "grading_basis": "Letter (ABCD/NP)",
        "units_min": "3",
        "units_max": "5",
        "final_exam": "False",
        "course_id": "216317",
        "active": "True",
        "offer_num": "2",
        "academic_group": "H&S",
        "academic_org": "COMMUN",
        "academic_career": "UG",
        "max_units_repeat": "5",
        "max_times_repeat": "1",
        "prerequisites": "",
        "corequisites": ""
    }
}